In [1]:
!python -V

Python 3.10.2

# <center> CONEXION A LA BASE DE DATOS</center>

In [2]:
# https://docs.sqlalchemy.org/en/14/core/engines.html#database-urls
# PostgreSQL, MySQL, Oracle, SQL Server, SQLite...
# https://github.com/googleapis/python-bigquery-sqlalchemy

#pip install sqlalchemy
#pip install pymysql


from sqlalchemy import create_engine

def mysql_connection_string():
    
    database = 'digitos'
    user = 'root'
    password = 12345678
    host = 'localhost'
    port = 3306
        
    return f'mysql+pymysql://{user}:{password}@{host}:{port}/{database}'

db_connection = create_engine(mysql_connection_string())
db_connection.__dict__

{'pool': <sqlalchemy.pool.impl.QueuePool at 0x1cb9c7c4e80>,
 'url': mysql+pymysql://root:***@localhost:3306/digitos,
 'dialect': <sqlalchemy.dialects.mysql.pymysql.MySQLDialect_pymysql at 0x1cb9c722bf0>,
 '_echo': None,
 'logger': <Logger sqlalchemy.engine.Engine (WARNING)>,
 'hide_parameters': False,
 '_compiled_cache': {}}

# <center> CONSULTAR LOS ESQUEMAS DE LA BASE DE DATOS </center>

In [3]:
import pandas as pd

query = """
SHOW DATABASES;
"""

pd.read_sql(query, con=db_connection)

             Database
0  information_schema
1  builderecosystemdb
2                  db
3             digitos
4               mysql
5  performance_schema
6             pokerap
7               rrrrl
8            unilibre

# <center> CONSULTAR TABLAS EN EL ESQUEMA</center>

In [4]:
import pandas as pd

query = """
SHOW TABLES;
"""

pd.read_sql(query, con=db_connection)

  Tables_in_digitos
0          detalles
1       divisible_5
2               dos
3          facturas
4         fibonacci
5           numeros
6               par
7               uno

# <center> VER EL DETALLE DE UNA TABLA</center>

In [5]:
query = """
DESCRIBE fibonacci;
"""

pd.read_sql(query, con=db_connection)

              Field          Type Null  Key Default Extra
0     nombre_numero  varchar(255)   NO  PRI    None
1  numero_fibonacci  varchar(255)   NO         None
2            cifras       int(11)   NO         None

# <center> CONSULTAR UNA TABLA</center>

In [6]:
query = """
SELECT * FROM uno
"""
db_connection.execute(query).fetchall()

[(1, 'amarillo', 1),
 (2, 'azul', 2),
 (3, 'rojo', 3),
 (4, 'LORO', 22),
 (5, 'Toro', 31),
 (95, 'otro', 0)]

In [7]:
query = """
SELECT * FROM uno
"""

pd.read_sql(query, con=db_connection)

   iduno     valor  precio
0      1  amarillo       1
1      2      azul       2
2      3      rojo       3
3      4      LORO      22
4      5      Toro      31
5     95      otro       0

# <center> USO DE LAS FUNCIONES DE AGREGACION Y ALIAS</center>

In [8]:
query = """
SELECT COUNT(VALOR) AS TOTAL_REGISTROS, 
SUM(VALOR) SUMA_VALORES, AVG(VALOR) AS PROMEDIO_VALORES, 
MAX(VALOR) AS VALOR_MAX, MIN(VALOR) AS VALOR_MIN 
FROM numeros
"""
pd.read_sql(query, con=db_connection)

   TOTAL_REGISTROS  SUMA_VALORES  PROMEDIO_VALORES  VALOR_MAX  VALOR_MIN
0             1001      500500.0             500.0       1000          0

# <center> CONDICIONES Y ORDENAMIENTO EN LAS CONSULTAS</center>

# <center> USO DE CONCAT, DISTINCT Y LIKE</center>

In [9]:
query = """
SELECT CONCAT("EL NUMERO ", nombre_numero , " TIENE ", cifras, " DIGITOS") AS Mensaje
FROM numeros
"""
pd.read_sql(query, con=db_connection)

                                       Mensaje
0            EL NUMERO Catorce TIENE 2 DIGITOS
1               EL NUMERO Cero TIENE 1 DIGITOS
2               EL NUMERO Cien TIENE 3 DIGITOS
3     EL NUMERO Ciento catorce TIENE 3 DIGITOS
4       EL NUMERO Ciento cinco TIENE 3 DIGITOS
...                                        ...
996       EL NUMERO Veintiocho TIENE 2 DIGITOS
997       EL NUMERO Veintiseis TIENE 2 DIGITOS
998      EL NUMERO Veintisiete TIENE 2 DIGITOS
999       EL NUMERO Veintitres TIENE 2 DIGITOS
1000       EL NUMERO Veintiuno TIENE 2 DIGITOS

[1001 rows x 1 columns]

In [10]:
query = """
SELECT DISTINCT(cifras)
FROM numeros
"""
pd.read_sql(query, con=db_connection)

   cifras
0       2
1       1
2       3
3       4

In [11]:
from sqlalchemy import text

query = """
SELECT * 
FROM numeros
WHERE nombre_numero LIKE '%uar%'
"""
pd.read_sql(text(query), con=db_connection)

                   nombre_numero  valor  cifras     creado
0                Ciento cuarenta    140       3 2023-01-21
1        Ciento cuarenta y cinco    145       3 2022-03-15
2       Ciento cuarenta y cuatro    144       3 2022-08-27
3          Ciento cuarenta y dos    142       3 2022-06-27
4        Ciento cuarenta y nueve    149       3 2022-04-15
..                           ...    ...     ...        ...
95   Trescientos cuarenta y ocho    348       3 2022-06-16
96   Trescientos cuarenta y seis    346       3 2022-07-11
97  Trescientos cuarenta y siete    347       3 2023-01-28
98   Trescientos cuarenta y tres    343       3 2022-08-17
99    Trescientos cuarenta y uno    341       3 2022-09-19

[100 rows x 4 columns]

In [12]:
query = """
SELECT * 
FROM numeros
WHERE nombre_numero LIKE 'cuar%'
"""
pd.read_sql(text(query), con=db_connection)

       nombre_numero  valor  cifras     creado
0           Cuarenta     40       2 2023-01-22
1   Cuarenta y cinco     45       2 2023-02-07
2  Cuarenta y cuatro     44       2 2023-02-26
3     Cuarenta y dos     42       2 2022-04-16
4   Cuarenta y nueve     49       2 2022-10-21
5    Cuarenta y ocho     48       2 2022-12-22
6    Cuarenta y seis     46       2 2022-04-08
7   Cuarenta y siete     47       2 2022-03-30
8    Cuarenta y tres     43       2 2022-03-23
9     Cuarenta y uno     41       2 2022-03-19

In [13]:
query = """
SELECT * 
FROM uno
WHERE valor LIKE '_o_o%'
"""
pd.read_sql(text(query), con=db_connection)

   iduno valor  precio
0      3  rojo       3
1      4  LORO      22
2      5  Toro      31

In [14]:
query = """
SELECT * 
FROM uno
WHERE valor LIKE '_oro%'
"""
pd.read_sql(text(query), con=db_connection)

   iduno valor  precio
0      4  LORO      22
1      5  Toro      31

# <center> IN/ANY - NOT IN/ALL</center>

In [15]:
query = """
SELECT * 
FROM uno
WHERE valor IN (SELECT valor FROM uno WHERE valor LIKE '_o_o%')
"""
pd.read_sql(text(query), con=db_connection)

   iduno valor  precio
0      3  rojo       3
1      4  LORO      22
2      5  Toro      31

In [16]:
query = """
SELECT * 
FROM uno
WHERE valor IN ('loro','TORO')
"""
pd.read_sql(text(query), con=db_connection)

   iduno valor  precio
0      4  LORO      22
1      5  Toro      31

In [17]:
query = """
SELECT * 
FROM uno
WHERE valor = ANY(SELECT valor FROM uno WHERE valor LIKE '_o_o%')

"""
pd.read_sql(text(query), con=db_connection)

   iduno valor  precio
0      3  rojo       3
1      4  LORO      22
2      5  Toro      31

In [18]:
query = """
SELECT * 
FROM uno
WHERE precio > ANY(SELECT precio FROM uno WHERE valor LIKE '_o_o%')

"""
pd.read_sql(text(query), con=db_connection)

   iduno valor  precio
0      4  LORO      22
1      5  Toro      31

In [19]:
query = """
SELECT * 
FROM uno
WHERE valor NOT IN ('loro','TORO')
"""
pd.read_sql(text(query), con=db_connection)

   iduno     valor  precio
0      1  amarillo       1
1      2      azul       2
2      3      rojo       3
3     95      otro       0

In [20]:
query = """
SELECT * 
FROM uno
WHERE precio > ALL(SELECT precio FROM uno WHERE precio < 20)
"""
pd.read_sql(query, con=db_connection)

   iduno valor  precio
0      4  LORO      22
1      5  Toro      31

In [21]:
query = """
SELECT * 
FROM uno
"""
print(pd.read_sql(query, con=db_connection))

query = """
SELECT * 
FROM uno
WHERE precio <> ALL(SELECT precio FROM uno 
                    WHERE valor = 'otro' OR valor = 'rojo')
"""
pd.read_sql(query, con=db_connection)

   iduno     valor  precio
0      1  amarillo       1
1      2      azul       2
2      3      rojo       3
3      4      LORO      22
4      5      Toro      31
5     95      otro       0

   iduno     valor  precio
0      1  amarillo       1
1      2      azul       2
2      4      LORO      22
3      5      Toro      31

In [22]:
query = """
SELECT * 
FROM uno
WHERE precio != ALL(SELECT precio FROM uno 
                    WHERE valor = 'otro' OR valor = 'rojo')
"""
pd.read_sql(query, con=db_connection)

   iduno     valor  precio
0      1  amarillo       1
1      2      azul       2
2      4      LORO      22
3      5      Toro      31

# <center> OR - AND - NOT</center>

In [23]:
query = """
SELECT * 
FROM uno
WHERE precio IN (SELECT precio FROM uno WHERE precio = 2 OR precio = 3)
"""
pd.read_sql(query, con=db_connection)

   iduno valor  precio
0      2  azul       2
1      3  rojo       3

In [24]:
query = """
SELECT * 
FROM uno
WHERE precio IN (SELECT precio FROM uno 
            WHERE precio <= 100 AND LENGTH(valor) > 4)
"""
pd.read_sql(query, con=db_connection)

   iduno     valor  precio
0      1  amarillo       1

In [25]:
query = """
SELECT * 
FROM uno
WHERE precio IN (SELECT precio FROM uno WHERE NOT precio > 9)
"""
pd.read_sql(query, con=db_connection)

   iduno     valor  precio
0      1  amarillo       1
1      2      azul       2
2      3      rojo       3
3     95      otro       0

In [26]:
query = """
SELECT * 
FROM uno
WHERE precio IN (SELECT precio FROM uno WHERE precio <= 9)
"""
pd.read_sql(query, con=db_connection)

   iduno     valor  precio
0      1  amarillo       1
1      2      azul       2
2      3      rojo       3
3     95      otro       0

# <center> ORDER BY</center>

In [27]:
query = """
SELECT * 
FROM par WHERE es_par = 1
ORDER BY nombre_numero ASC
"""

pd.read_sql(query, con=db_connection)

       nombre_numero  es_par
0    A TEST JOIN PAR       1
1            Catorce       1
2               Cero       1
3               Cien       1
4     Ciento catorce       1
..               ...     ...
497           Veinte       1
498     Veinticuatro       1
499        Veintidos       1
500       Veintiocho       1
501       Veintiseis       1

[502 rows x 2 columns]

In [28]:
query = """
SELECT * 
FROM par WHERE es_par = 1
ORDER BY nombre_numero DESC
"""

pd.read_sql(query, con=db_connection)

       nombre_numero  es_par
0         Veintiseis       1
1         Veintiocho       1
2          Veintidos       1
3       Veinticuatro       1
4             Veinte       1
..               ...     ...
497   Ciento catorce       1
498             Cien       1
499             Cero       1
500          Catorce       1
501  A TEST JOIN PAR       1

[502 rows x 2 columns]

# <center> BETWEEN </center>

In [29]:
query = """
SELECT * 
FROM numeros
WHERE creado BETWEEN '2022-07-25' AND '2022-07-31'
ORDER BY creado ASC
"""

pd.read_sql(query, con=db_connection)

                  nombre_numero  valor  cifras     creado
0        Ciento noventa y siete    197       3 2022-07-25
1           Trescientos treinta    330       3 2022-07-25
2                Setenta y tres     73       2 2022-07-26
3   Trescientos ochenta y cinco    385       3 2022-07-26
4            Ciento veinticinco    125       3 2022-07-27
5   Doscientos cincuenta y ocho    258       3 2022-07-27
6                Treinta y seis     36       2 2022-07-27
7    Doscientos sesenta y siete    267       3 2022-07-28
8              Ochocientos diez    810       3 2022-07-29
9   Ochocientos setenta y nueve    879       3 2022-07-29
10        Seiscientos dieciseis    616       3 2022-07-29
11   Novecientos treinta y ocho    938       3 2022-07-30
12       Trescientos veintiocho    328       3 2022-07-30

In [30]:
query = """
SELECT * 
FROM numeros
WHERE valor BETWEEN 7 AND 13
ORDER BY valor ASC
"""

pd.read_sql(query, con=db_connection)

  nombre_numero  valor  cifras     creado
0         Siete      7       1 2022-06-11
1          Ocho      8       1 2022-04-23
2         Nueve      9       1 2022-05-07
3          Diez     10       2 2022-04-01
4          Once     11       2 2022-05-31
5          Doce     12       2 2022-05-28
6         Trece     13       2 2023-01-16

In [31]:
query = """
SELECT * 
FROM numeros
WHERE nombre_numero BETWEEN 'Siete' AND 'Trece'
ORDER BY nombre_numero ASC
"""

pd.read_sql(query, con=db_connection)

  nombre_numero  valor  cifras     creado
0         Siete      7       1 2022-06-11
1         Trece     13       2 2023-01-16

# <center> CASE</center>

In [32]:
query = """
SELECT *,
    CASE
        WHEN es_par < 0 THEN 'EL VALOR ES NEGATIVO'
        WHEN es_par = 1 THEN 'EL VALOR ES PAR'
        ELSE 'EL VALOR ES IMPAR'
    END AS DESCRIPTION
FROM par
LIMIT 10
"""

    
pd.read_sql(query, con=db_connection)

               nombre_numero  es_par        DESCRIPTION
0            A TEST JOIN PAR       1    EL VALOR ES PAR
1                    Catorce       1    EL VALOR ES PAR
2                       Cero       1    EL VALOR ES PAR
3                       Cien       1    EL VALOR ES PAR
4             Ciento catorce       1    EL VALOR ES PAR
5               Ciento cinco       0  EL VALOR ES IMPAR
6           Ciento cincuenta       1    EL VALOR ES PAR
7   Ciento cincuenta y cinco       0  EL VALOR ES IMPAR
8  Ciento cincuenta y cuatro       1    EL VALOR ES PAR
9     Ciento cincuenta y dos       1    EL VALOR ES PAR

In [33]:
query = """
SELECT es_par,
    SUM(CASE WHEN es_par = 1 THEN 1 ELSE 0 END) AS PARES,
    SUM(CASE WHEN es_par = 0 THEN 1 ELSE 0 END) AS IMPARES
FROM par
GROUP BY es_par
"""

pd.read_sql(query, con=db_connection)

   es_par  PARES  IMPARES
0       0    0.0    500.0
1       1  502.0      0.0

# <center> MULTIPLE ORDENAMIENTO</center>

In [34]:
query = """
SELECT * 
FROM fibonacci
ORDER BY cifras ASC, nombre_numero DESC
"""

pd.read_sql(query, con=db_connection)

,nombre_numero,numero_fibonacci,cifras
0,Uno,1,1
1,Tres,2,1
2,Seis,8,1
3,Dos,1,1
4,Cuatro,3,1
...,...,...,...
996,Novecientos noventa y cinco,3919377061614420000000000000000000000000000000...,208
997,Novecientos noventa y siete,1026106236203330000000000000000000000000000000...,209
998,Novecientos noventa y ocho,1660274766245210000000000000000000000000000000...,209
999,Novecientos noventa y nueve,2686381002448530000000000000000000000000000000...,209
1000,Mil,4346655768693740000000000000000000000000000000...,209

# <center> LIMIT Y OFFSET PAGINACION</center>

In [36]:
query = """
SELECT * 
FROM par WHERE es_par = 1
ORDER BY nombre_numero ASC
LIMIT 15
"""

pd.read_sql(query, con=db_connection)

                nombre_numero  es_par
0             A TEST JOIN PAR       1
1                     Catorce       1
2                        Cero       1
3                        Cien       1
4              Ciento catorce       1
5            Ciento cincuenta       1
6   Ciento cincuenta y cuatro       1
7      Ciento cincuenta y dos       1
8     Ciento cincuenta y ocho       1
9     Ciento cincuenta y seis       1
10            Ciento cuarenta       1
11   Ciento cuarenta y cuatro       1
12      Ciento cuarenta y dos       1
13     Ciento cuarenta y ocho       1
14     Ciento cuarenta y seis       1

In [37]:
query = """
SELECT * 
FROM par WHERE es_par = 1
ORDER BY nombre_numero ASC
LIMIT 10
OFFSET 5
"""

pd.read_sql(query, con=db_connection)

               nombre_numero  es_par
0           Ciento cincuenta       1
1  Ciento cincuenta y cuatro       1
2     Ciento cincuenta y dos       1
3    Ciento cincuenta y ocho       1
4    Ciento cincuenta y seis       1
5            Ciento cuarenta       1
6   Ciento cuarenta y cuatro       1
7      Ciento cuarenta y dos       1
8     Ciento cuarenta y ocho       1
9     Ciento cuarenta y seis       1

# <center> GROUP BY Y HAVING</center>

In [38]:
query = """
SELECT creado, COUNT(creado) AS TOTAL_FECHAS 
FROM numeros
GROUP BY creado
"""

pd.read_sql(query, con=db_connection)

        creado  TOTAL_FECHAS
0   2022-03-08             2
1   2022-03-09             2
2   2022-03-10             5
3   2022-03-11             5
4   2022-03-12             5
..         ...           ...
336 2023-03-02             3
337 2023-03-03             4
338 2023-03-04             5
339 2023-03-05             4
340 2023-03-06             2

[341 rows x 2 columns]

In [39]:
query = """
SELECT creado, COUNT(creado) AS TOTAL_FECHAS 
FROM numeros
GROUP BY creado
HAVING TOTAL_FECHAS > 4 AND TOTAL_FECHAS < 6
ORDER BY creado DESC
LIMIT 10
OFFSET 3
"""

pd.read_sql(query, con=db_connection)

      creado  TOTAL_FECHAS
0 2023-01-31             5
1 2023-01-28             5
2 2023-01-19             5
3 2022-11-15             5
4 2022-11-12             5
5 2022-11-07             5
6 2022-10-31             5
7 2022-10-19             5
8 2022-10-10             5
9 2022-10-08             5

# <center> JOIN</center>

In [40]:
query = """
SELECT * 
FROM divisible_5 
JOIN par 
ON divisible_5.nombre_numero = par.nombre_numero
LIMIT 5
"""

pd.read_sql(query, con=db_connection)

    nombre_numero  es_divisible   nombre_numero  es_par
0         Catorce             0         Catorce       1
1            Cero             1            Cero       1
2            Cien             1            Cien       1
3  Ciento catorce             0  Ciento catorce       1
4    Ciento cinco             1    Ciento cinco       0

In [41]:
query = """
SELECT * 
FROM divisible_5, par 
WHERE divisible_5.nombre_numero = par.nombre_numero
LIMIT 5
"""

pd.read_sql(query, con=db_connection)

    nombre_numero  es_divisible   nombre_numero  es_par
0         Catorce             0         Catorce       1
1            Cero             1            Cero       1
2            Cien             1            Cien       1
3  Ciento catorce             0  Ciento catorce       1
4    Ciento cinco             1    Ciento cinco       0

In [42]:
query = """
SELECT * 
FROM numeros 
JOIN fibonacci 
ON numeros.nombre_numero = fibonacci.nombre_numero
JOIN par 
ON fibonacci.nombre_numero = par.nombre_numero
LIMIT 5
"""

pd.read_sql(query, con=db_connection)

,nombre_numero,valor,cifras,creado,nombre_numero,numero_fibonacci,cifras,nombre_numero,es_par
0,Catorce,14,2,2022-07-24,Catorce,377,3,Catorce,1
1,Cero,0,1,2022-11-28,Cero,0,1,Cero,1
2,Cien,100,3,2022-09-07,Cien,354224848179262000000,21,Cien,1
3,Ciento catorce,114,3,2022-07-05,Ciento catorce,298611126818977000000000,24,Ciento catorce,1
4,Ciento cinco,105,3,2022-04-24,Ciento cinco,3928413764606870000000,22,Ciento cinco,0

In [43]:
query = """
SELECT * 
FROM numeros, fibonacci, par 
WHERE numeros.nombre_numero = fibonacci.nombre_numero
AND fibonacci.nombre_numero = par.nombre_numero
LIMIT 5
"""

pd.read_sql(query, con=db_connection)

,nombre_numero,valor,cifras,creado,nombre_numero,numero_fibonacci,cifras,nombre_numero,es_par
0,Catorce,14,2,2022-07-24,Catorce,377,3,Catorce,1
1,Cero,0,1,2022-11-28,Cero,0,1,Cero,1
2,Cien,100,3,2022-09-07,Cien,354224848179262000000,21,Cien,1
3,Ciento catorce,114,3,2022-07-05,Ciento catorce,298611126818977000000000,24,Ciento catorce,1
4,Ciento cinco,105,3,2022-04-24,Ciento cinco,3928413764606870000000,22,Ciento cinco,0

# <center> LEFT JOIN Y RIGHT JOIN</center>

In [44]:
query = """
SELECT * 
FROM divisible_5 
LEFT JOIN par 
ON divisible_5.nombre_numero = par.nombre_numero
LIMIT 5
"""

pd.read_sql(query, con=db_connection)

                 nombre_numero  es_divisible   nombre_numero  es_par
0  A TEST JOIN DIVISIBLE POR 5             0            None     NaN
1                      Catorce             0         Catorce     1.0
2                         Cero             1            Cero     1.0
3                         Cien             1            Cien     1.0
4               Ciento catorce             0  Ciento catorce     1.0

In [45]:
query = """
SELECT * 
FROM divisible_5 
RIGHT JOIN par 
ON divisible_5.nombre_numero = par.nombre_numero
LIMIT 5
"""

pd.read_sql(query, con=db_connection)

    nombre_numero  es_divisible    nombre_numero  es_par
0            None           NaN  A TEST JOIN PAR       1
1         Catorce           0.0          Catorce       1
2            Cero           1.0             Cero       1
3            Cien           1.0             Cien       1
4  Ciento catorce           0.0   Ciento catorce       1

# <center> SUB QUERY - EXISTS</center>

In [46]:
query = """
SELECT *
FROM numeros
WHERE cifras <= (SELECT AVG(cifras)/70 FROM fibonacci)
"""
pd.read_sql(query, con=db_connection)

  nombre_numero  valor  cifras     creado
0          Cero      0       1 2022-11-28
1         Cinco      5       1 2022-06-25
2        Cuatro      4       1 2022-03-17
3           Dos      2       1 2023-02-04
4         Nueve      9       1 2022-05-07
5          Ocho      8       1 2022-04-23
6          Seis      6       1 2022-06-15
7         Siete      7       1 2022-06-11
8          Tres      3       1 2022-10-10
9           Uno      1       1 2022-05-12

In [47]:
query = """
SELECT * FROM numeros as n 
WHERE EXISTS 
    (SELECT cifras FROM fibonacci AS f 
    WHERE n.nombre_numero = f.nombre_numero
    AND LENGTH(nombre_numero) < 4)
"""
pd.read_sql(query, con=db_connection)

  nombre_numero  valor  cifras     creado
0           Dos      2       1 2023-02-04
1           Mil   1000       4 2022-04-05
2           Uno      1       1 2022-05-12

# <center>UNION, INTERSECT Y EXCEPT</center>

In [48]:
query = """
SELECT * 
FROM uno
"""

print(pd.read_sql(query, con=db_connection))
print()

query = """
SELECT * 
FROM dos
"""

pd.read_sql(query, con=db_connection)

   iduno     valor  precio
0      1  amarillo       1
1      2      azul       2
2      3      rojo       3
3      4      LORO      22
4      5      Toro      31
5     95      otro       0

   iddos  valor_dos  precio
0      1       LORO       1
1      5       toro     310
2      7        sol     230
3      9       luna     130
4     78  estrellas     250
5     95       otro       0

In [49]:
query = """
SELECT precio 
FROM uno 

UNION ALL

SELECT precio
FROM dos

"""

pd.read_sql(query, con=db_connection)

    precio
0        1
1        2
2        3
3       22
4       31
5        0
6        1
7      310
8      230
9      130
10     250
11       0

In [50]:
query = """
SELECT precio 
FROM uno 

UNION

SELECT precio
FROM dos

"""

pd.read_sql(query, con=db_connection)

   precio
0       1
1       2
2       3
3      22
4      31
5       0
6     310
7     230
8     130
9     250

# <center>DELETE, TRUNCATE, INSERT, UPDATE</center>

# <center>DELETE</center>

In [51]:
query = """
SELECT * FROM dos
"""

pd.read_sql(query, con=db_connection)

   iddos  valor_dos  precio
0      1       LORO       1
1      5       toro     310
2      7        sol     230
3      9       luna     130
4     78  estrellas     250
5     95       otro       0

In [52]:
query = """
DELETE FROM dos WHERE precio < 20
"""

try:
    pd.read_sql(query, con=db_connection)
except:
    print('NO Ejecutar Comandos Diferentes a SELECT usando "pd.read_sql"')

NO Ejecutar Comandos Diferentes a SELECT usando "pd.read_sql"

In [53]:
query = """
SELECT * FROM dos
"""

pd.read_sql(query, con=db_connection)

   iddos  valor_dos  precio
0      5       toro     310
1      7        sol     230
2      9       luna     130
3     78  estrellas     250

# <center>TRUNCATE</center>

In [54]:
query = """
TRUNCATE TABLE dos
"""

print(db_connection.execute(query).__dict__)
print()

query = """
SELECT * FROM dos
"""

pd.read_sql(query, con=db_connection)

{'context': <sqlalchemy.dialects.mysql.mysqldb.MySQLExecutionContext_mysqldb object at 0x000001CBA3A40070>, 'dialect': <sqlalchemy.dialects.mysql.pymysql.MySQLDialect_pymysql object at 0x000001CB9C722BF0>, 'cursor': None, 'cursor_strategy': <sqlalchemy.engine.cursor.NoCursorDMLFetchStrategy object at 0x000001CB997687E0>, 'connection': <sqlalchemy.engine.base.Connection object at 0x000001CB9B0970A0>, '_echo': False, '_metadata': <sqlalchemy.engine.cursor._LegacyNoResultMetaData object at 0x000001CB997723E0>, 'rowcount': 0, '_soft_closed': True}

Empty DataFrame
Columns: [iddos, valor_dos, precio]
Index: []

# <center>INSERT</center>

In [55]:
query = """
INSERT INTO dos VALUES 
(7,'sol',23),
(9,'luna',13),
(78,'estrellas',25),
(95,'otro',0),
('4', 'LORO', '22'),
('5', 'Toro', '31')
"""

print(db_connection.execute(query).__dict__)
print()

query = """
SELECT * FROM dos
"""

pd.read_sql(query, con=db_connection)

{'context': <sqlalchemy.dialects.mysql.mysqldb.MySQLExecutionContext_mysqldb object at 0x000001CBA3A40EE0>, 'dialect': <sqlalchemy.dialects.mysql.pymysql.MySQLDialect_pymysql object at 0x000001CB9C722BF0>, 'cursor': None, 'cursor_strategy': <sqlalchemy.engine.cursor.NoCursorDMLFetchStrategy object at 0x000001CB997687E0>, 'connection': <sqlalchemy.engine.base.Connection object at 0x000001CBA3A3EEF0>, '_echo': False, '_metadata': <sqlalchemy.engine.cursor._LegacyNoResultMetaData object at 0x000001CB997723E0>, 'rowcount': 6, '_soft_closed': True}

   iddos  valor_dos  precio
0      4       LORO      22
1      5       Toro      31
2      7        sol      23
3      9       luna      13
4     78  estrellas      25
5     95       otro       0

# <center>UPDATE</center>

In [56]:
query = """
UPDATE dos
SET
valor_dos = UPPER(valor_dos),
iddos = 1, 
precio = 1 
WHERE valor_dos = 'LORO';

"""

print(db_connection.execute(query).__dict__)
print()

query = """
SELECT * FROM dos
"""

pd.read_sql(text(query), con=db_connection)

{'context': <sqlalchemy.dialects.mysql.mysqldb.MySQLExecutionContext_mysqldb object at 0x000001CBA3945DE0>, 'dialect': <sqlalchemy.dialects.mysql.pymysql.MySQLDialect_pymysql object at 0x000001CB9C722BF0>, 'cursor': None, 'cursor_strategy': <sqlalchemy.engine.cursor.NoCursorDMLFetchStrategy object at 0x000001CB997687E0>, 'connection': <sqlalchemy.engine.base.Connection object at 0x000001CBA3A3F400>, '_echo': False, '_metadata': <sqlalchemy.engine.cursor._LegacyNoResultMetaData object at 0x000001CB997723E0>, 'rowcount': 1, '_soft_closed': True}

   iddos  valor_dos  precio
0      1       LORO       1
1      5       Toro      31
2      7        sol      23
3      9       luna      13
4     78  estrellas      25
5     95       otro       0

In [57]:
query = """
UPDATE dos
SET
valor_dos = LOWER(valor_dos),
precio = precio * 10
"""

print(db_connection.execute(query).__dict__)
print()

query = """
SELECT * FROM dos
"""

pd.read_sql(text(query), con=db_connection)

{'context': <sqlalchemy.dialects.mysql.mysqldb.MySQLExecutionContext_mysqldb object at 0x000001CBA3A41D80>, 'dialect': <sqlalchemy.dialects.mysql.pymysql.MySQLDialect_pymysql object at 0x000001CB9C722BF0>, 'cursor': None, 'cursor_strategy': <sqlalchemy.engine.cursor.NoCursorDMLFetchStrategy object at 0x000001CB997687E0>, 'connection': <sqlalchemy.engine.base.Connection object at 0x000001CBA3A3EB60>, '_echo': False, '_metadata': <sqlalchemy.engine.cursor._LegacyNoResultMetaData object at 0x000001CB997723E0>, 'rowcount': 6, '_soft_closed': True}

   iddos  valor_dos  precio
0      1       loro      10
1      5       toro     310
2      7        sol     230
3      9       luna     130
4     78  estrellas     250
5     95       otro       0